-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- 생성 시간: 20-12-23 06:10
-- 서버 버전: 10.4.13-MariaDB
-- PHP 버전: 7.3.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `edu`
--

DELIMITER $$
--
-- 프로시저
--
DROP PROCEDURE IF EXISTS `dummyBoard`$$
CREATE DEFINER=`root`@`localhost` PROCEDURE `dummyBoard` (IN `p_loop` INT)  BEGIN
	declare cnt int default 2;
    delete from tbl_board where bno > 1;
    while cnt <= p_loop do
    INSERT INTO tbl_board (bno, title, content, writer) 
    VALUES 
    (cnt, concat(cnt, '번째 게시물입니다.'), '게시물 내용', 'admin');
    set cnt = cnt +1;
    end while;
END$$

DROP PROCEDURE IF EXISTS `dummyMember`$$
CREATE DEFINER=`root`@`localhost` PROCEDURE `dummyMember` (IN `p_loop` INT)  BEGIN
declare cnt int default 1;#반복문 변수선언
    delete from tbl_member where user_id like 'dummy%';
    while cnt <= p_loop do
		INSERT INTO tbl_member(user_id,user_pw,user_name,email,point,enabled,levels) 
		VALUES 
		(concat('dummy_',cnt) , '1234', '관리자', 'admin@abc.com', '0', '1', 'ROLE_ADMIN');
        set cnt = cnt + 1;
    end while;

END$$

DELIMITER ;

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_attach`
--

DROP TABLE IF EXISTS `tbl_attach`;
CREATE TABLE IF NOT EXISTS `tbl_attach` (
  `file_name` varchar(255) NOT NULL COMMENT '첨부파일명',
  `bno` int(11) NOT NULL COMMENT '부모 게시물의 일련번호',
  `reg_date` timestamp NULL DEFAULT current_timestamp() COMMENT '등록일자',
  PRIMARY KEY (`file_name`),
  KEY `fk_tbl_attach_tbl_board_idx` (`bno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='게시물 첨부파일';

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_board`
--

DROP TABLE IF EXISTS `tbl_board`;
CREATE TABLE IF NOT EXISTS `tbl_board` (
  `bno` int(11) NOT NULL AUTO_INCREMENT COMMENT '게시물 일련번호\nAI 일려번호를 자동증가 가능',
  `title` varchar(255) DEFAULT NULL COMMENT '제목',
  `content` text DEFAULT NULL COMMENT '게시물 내용',
  `writer` varchar(45) DEFAULT NULL COMMENT '작성자',
  `view_count` int(11) DEFAULT 0 COMMENT '게시글 조회수',
  `reply_count` int(11) DEFAULT 0 COMMENT '댓글 개수',
  `reg_date` timestamp NULL DEFAULT current_timestamp() COMMENT '등록 일자',
  `update_date` timestamp NULL DEFAULT current_timestamp() COMMENT '수정 날짜',
  PRIMARY KEY (`bno`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8 COMMENT='게시물 관리';

--
-- 테이블의 덤프 데이터 `tbl_board`
--

INSERT INTO `tbl_board` (`bno`, `title`, `content`, `writer`, `view_count`, `reply_count`, `reg_date`, `update_date`) VALUES
(1, '1번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 03:24:17', '2020-12-23 03:24:17'),
(2, '2번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(3, '3번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(4, '4번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(5, '5번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(6, '6번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(7, '7번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(8, '8번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(9, '9번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(10, '10번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(11, '11번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(12, '12번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(13, '13번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(14, '14번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(15, '15번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(16, '16번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(17, '17번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(18, '18번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(19, '19번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(20, '20번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(21, '21번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(22, '22번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(23, '23번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(24, '24번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(25, '25번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(26, '26번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(27, '27번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(28, '28번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(29, '29번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(30, '30번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(31, '31번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(32, '32번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(33, '33번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(34, '34번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(35, '35번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(36, '36번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(37, '37번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(38, '38번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(39, '39번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(40, '40번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(41, '41번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(42, '42번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(43, '43번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(44, '44번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(45, '45번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(46, '46번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(47, '47번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(48, '48번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(49, '49번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(50, '50번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(51, '51번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(52, '52번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(53, '53번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(54, '54번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(55, '55번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(56, '56번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(57, '57번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(58, '58번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(59, '59번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(60, '60번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(61, '61번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(62, '62번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(63, '63번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(64, '64번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(65, '65번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(66, '66번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(67, '67번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(68, '68번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(69, '69번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(70, '70번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(71, '71번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(72, '72번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(73, '73번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(74, '74번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(75, '75번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(76, '76번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(77, '77번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(78, '78번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(79, '79번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(80, '80번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(81, '81번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(82, '82번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(83, '83번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(84, '84번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(85, '85번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(86, '86번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(87, '87번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(88, '88번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(89, '89번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(90, '90번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(91, '91번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(92, '92번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(93, '93번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(94, '94번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(95, '95번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(96, '96번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(97, '97번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(98, '98번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(99, '99번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(100, '100번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(101, '101번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(102, '102번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(103, '103번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(104, '104번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(105, '105번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(106, '106번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(107, '107번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(108, '108번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(109, '109번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11'),
(110, '110번째 게시물입니다.', '게시물 내용', 'admin', 0, 0, '2020-12-23 06:03:11', '2020-12-23 06:03:11');

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_member`
--

DROP TABLE IF EXISTS `tbl_member`;
CREATE TABLE IF NOT EXISTS `tbl_member` (
  `user_id` varchar(45) NOT NULL COMMENT '회원 아이디',
  `user_pw` varchar(255) DEFAULT NULL COMMENT '회원 로그인 암호',
  `user_name` varchar(255) DEFAULT NULL COMMENT '회원 이름',
  `email` varchar(255) DEFAULT NULL COMMENT '회원 이메일',
  `point` int(11) DEFAULT 0 COMMENT '적립 포인트',
  `enabled` int(1) DEFAULT 1 COMMENT '활동 가능 여부\n로그인 가능여부',
  `levels` varchar(45) DEFAULT 'ROLE_USER' COMMENT '권한값\nROLE_ADMUN (관리자)\nROLE_USER (사용자)',
  `reg_date` timestamp NULL DEFAULT current_timestamp() COMMENT '등록일자\n1970부터 초단위로 현재까지 계산한 값',
  `update_date` timestamp NULL DEFAULT current_timestamp() COMMENT '수정 일자',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='회원 관리';

--
-- 테이블의 덤프 데이터 `tbl_member`
--

INSERT INTO `tbl_member` (`user_id`, `user_pw`, `user_name`, `email`, `point`, `enabled`, `levels`, `reg_date`, `update_date`) VALUES
('admin', '1234', '관리자', 'abc@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 03:03:36', '2020-12-23 03:03:36'),
('dummy_1', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_10', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_100', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_101', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_102', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_103', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_104', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_105', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_106', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_107', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_108', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_109', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_11', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_110', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_12', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_13', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_14', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_15', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_16', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_17', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_18', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_19', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_2', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_20', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_21', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_22', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_23', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_24', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_25', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_26', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_27', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_28', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_29', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_3', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_30', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_31', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_32', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_33', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_34', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_35', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_36', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_37', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_38', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_39', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_4', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_40', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_41', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_42', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_43', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_44', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_45', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_46', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_47', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_48', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_49', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_5', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_50', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_51', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_52', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_53', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_54', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_55', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_56', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_57', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_58', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_59', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_6', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_60', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_61', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_62', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_63', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_64', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_65', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_66', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_67', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_68', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_69', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_7', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_70', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_71', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_72', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_73', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_74', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_75', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_76', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_77', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_78', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_79', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_8', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_80', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_81', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_82', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_83', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_84', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_85', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_86', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_87', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_88', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_89', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_9', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_90', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_91', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_92', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_93', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_94', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_95', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_96', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_97', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_98', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05'),
('dummy_99', '1234', '관리자', 'admin@abc.com', 0, 1, 'ROLE_ADMIN', '2020-12-23 06:03:05', '2020-12-23 06:03:05');

-- --------------------------------------------------------

--
-- 테이블 구조 `tbl_reply`
--

DROP TABLE IF EXISTS `tbl_reply`;
CREATE TABLE IF NOT EXISTS `tbl_reply` (
  `rno` int(11) NOT NULL AUTO_INCREMENT COMMENT '댓글 일련번호',
  `bno` int(11) NOT NULL COMMENT '부모 게시글 일련번호',
  `reply_text` varchar(1000) DEFAULT NULL COMMENT '댓글내용',
  `replyer` varchar(45) DEFAULT NULL COMMENT '작성자',
  `reg_date` timestamp NULL DEFAULT current_timestamp() COMMENT '등록일시',
  `update_date` timestamp NULL DEFAULT current_timestamp() COMMENT '수정일시',
  PRIMARY KEY (`rno`),
  KEY `fk_tbl_reply_tbl_board1_idx` (`bno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='댓글관리';

--
-- 덤프된 테이블의 제약사항
--

--
-- 테이블의 제약사항 `tbl_attach`
--
ALTER TABLE `tbl_attach`
  ADD CONSTRAINT `fk_tbl_attach_tbl_board` FOREIGN KEY (`bno`) REFERENCES `tbl_board` (`bno`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- 테이블의 제약사항 `tbl_reply`
--
ALTER TABLE `tbl_reply`
  ADD CONSTRAINT `fk_tbl_reply_tbl_board1` FOREIGN KEY (`bno`) REFERENCES `tbl_board` (`bno`) ON DELETE NO ACTION ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
